Protocentral/healthypi-move-fw/drivers/sensor/max32664/max32664.c
	gpio_pin_set_dt(&config->mfio_gpio, 0);
	k_sleep(K_USEC(300));

	i2c_write_dt(&config->i2c, wr_buf, sizeof(wr_buf));
	i2c_read_dt(&config->i2c, rd_buf, sizeof(rd_buf));
	k_sleep(K_USEC(300));
	gpio_pin_set_dt(&config->mfio_gpio, 1);

	// printk("Stat %x | ", rd_buf[1]);

	return rd_buf[1];
}

static int m_get_ver(const struct device *dev, uint8_t *ver_buf)
{
	const struct max32664_config *config = dev->config;

	uint8_t wr_buf[2] = {0xFF, 0x03};

	k_sleep(K_USEC(300));
	i2c_write_dt(&config->i2c, wr_buf, sizeof(wr_buf));
	k_sleep(K_MSEC(MAX32664_DEFAULT_CMD_DELAY));

	i2c_read_dt(&config->i2c, ver_buf, 4);
	k_sleep(K_MSEC(MAX32664_DEFAULT_CMD_DELAY));

	//LOG_INF("Version (decimal) = %d.%d.%d\n", ver_buf[1], ver_buf[2], ver_buf[3]);

	if(ver_buf[1] == 0x00 && ver_buf[2] == 0x00 && ver_buf[3] == 0x00)
	{
		return -ENODEV;
	}

	return 0;
}


static int max32664_load_fw(const struct device *dev, uint8_t *fw_bin_array)
{
	uint8_t msbl_num_pages = 0;
	uint16_t msbl_write_pos = 0;

#if (MAX32664_FW_BIN_INCLUDE == 1)
	printk("---\nLoading MSBL\n");
	printk("MSBL Array Size: %d\n", sizeof(maxm86146_msbl));

	msbl_num_pages = fw_bin_array[0x44];
	printk("MSBL Load: Pages: %d (%x)\n", msbl_num_pages, msbl_num_pages);

	m_read_mcu_id(dev);

	m_write_set_num_pages(dev, msbl_num_pages);

	memcpy(max32664_fw_init_vector, &fw_bin_array[0x28], 11);
	m_write_init_vector(dev, max32664_fw_init_vector);
	printk("MSBL Init Vector: %x %x %x %x %x %x %x %x %x %x %x\n", max32664_fw_init_vector[0], max32664_fw_init_vector[1], max32664_fw_init_vector[2], max32664_fw_init_vector[3], max32664_fw_init_vector[4], max32664_fw_init_vector[5], max32664_fw_init_vector[6], max32664_fw_init_vector[7], max32664_fw_init_vector[8], max32664_fw_init_vector[9], max32664_fw_init_vector[10]);

	memcpy(max32664_fw_auth_vector, &fw_bin_array[0x34], 16);
	m_write_auth_vector(dev, max32664_fw_auth_vector);

	m_erase_app(dev);
	k_sleep(K_MSEC(2000));

	// Write MSBL

	for (int i = 0; i < msbl_num_pages; i++)
	{
		printk("Writing Page: %d of %d\n", (i + 1), msbl_num_pages);

		// memcpy(max32664_fw_page_buf, &fw_bin_array[MAX32664_FW_UPDATE_START_ADDR + (i * MAX32664_FW_UPDATE_WRITE_SIZE)], MAX32664_FW_UPDATE_WRITE_SIZE);
		uint32_t msbl_page_offset = (MAX32664_FW_UPDATE_START_ADDR + (i * MAX32664_FW_UPDATE_WRITE_SIZE));
		printk("MSBL Page Offset: %d (%x)\n", msbl_page_offset, msbl_page_offset);
		m_fw_write_page(dev, maxm86146_msbl, msbl_page_offset);

		k_sleep(K_MSEC(500));
	}
#endif

	max32664_do_enter_app(dev);

	printk("End Load MSBL\n---\n");

	return 0;
}

static int m_i2c_write_cmd_4(const struct device *dev, uint8_t byte1, uint8_t byte2, uint8_t byte3, uint8_t byte4)
{
	const struct max32664_config *config = dev->config;
	uint8_t wr_buf[4];
	uint8_t rd_buf[1];

	wr_buf[0] = byte1;
	wr_buf[1] = byte2;
	wr_buf[2] = byte3;
	wr_buf[3] = byte4;

	gpio_pin_set_dt(&config->mfio_gpio, 0);
	k_sleep(K_USEC(300));

	i2c_write_dt(&config->i2c, wr_buf, sizeof(wr_buf));
	k_sleep(K_MSEC(MAX32664_DEFAULT_CMD_DELAY));
	i2c_read_dt(&config->i2c, rd_buf, 1);
	k_sleep(K_MSEC(MAX32664_DEFAULT_CMD_DELAY));

	gpio_pin_set_dt(&config->mfio_gpio, 1);

	printk("CMD: %x %x %x %x | RSP: %x\n", wr_buf[0], wr_buf[1], wr_buf[2], wr_buf[3], rd_buf[0]);

	k_sleep(K_MSEC(45));

	return 0;
}

static int m_i2c_write_cmd_5(const struct device *dev, uint8_t byte1, uint8_t byte2, uint8_t byte3, uint8_t byte4, uint8_t byte5)
{
	const struct max32664_config *config = dev->config;
	uint8_t wr_buf[5];
	uint8_t rd_buf[1];

	wr_buf[0] = byte1;
	wr_buf[1] = byte2;
	wr_buf[2] = byte3;
	wr_buf[3] = byte4;
	wr_buf[4] = byte5;

	gpio_pin_set_dt(&config->mfio_gpio, 0);
	k_sleep(K_USEC(300));

	i2c_write_dt(&config->i2c, wr_buf, sizeof(wr_buf));
	k_sleep(K_MSEC(MAX32664_DEFAULT_CMD_DELAY));
	i2c_read_dt(&config->i2c, rd_buf, 1);
	k_sleep(K_MSEC(MAX32664_DEFAULT_CMD_DELAY));

	gpio_pin_set_dt(&config->mfio_gpio, 1);

	printk("CMD: %x %x %x %x %x | RSP: %x\n", wr_buf[0], wr_buf[1], wr_buf[2], wr_buf[3], wr_buf[4], rd_buf[0]);

	k_sleep(K_MSEC(45));

	return 0;
}

int max32664_get_fifo_count(const struct device *dev)
{
	const struct max32664_config *config = dev->config;
	uint8_t rd_buf[2] = {0x00, 0x00};
	uint8_t wr_buf[2] = {0x12, 0x00};

	uint8_t fifo_count;
	gpio_pin_set_dt(&config->mfio_gpio, 0);
	k_sleep(K_USEC(300));

	i2c_write_dt(&config->i2c, wr_buf, sizeof(wr_buf));
	i2c_read_dt(&config->i2c, rd_buf, sizeof(rd_buf));

	gpio_pin_set_dt(&config->mfio_gpio, 1);

	fifo_count = rd_buf[1];
	return (int)fifo_count;
}

static int m_i2c_write_cmd_3(const struct device *dev, uint8_t byte1, uint8_t byte2, uint8_t byte3, uint16_t cmd_delay)
{
	const struct max32664_config *config = dev->config;
	uint8_t wr_buf[3];

	uint8_t rd_buf[1] = {0x00};

	wr_buf[0] = byte1;
	wr_buf[1] = byte2;
	wr_buf[2] = byte3;

	gpio_pin_set_dt(&config->mfio_gpio, 0);
	k_sleep(K_USEC(300));

	i2c_write_dt(&config->i2c, wr_buf, sizeof(wr_buf));
	k_sleep(K_MSEC(cmd_delay));

	i2c_read_dt(&config->i2c, rd_buf, sizeof(rd_buf));
	k_sleep(K_USEC(300));

	gpio_pin_set_dt(&config->mfio_gpio, 1);

	printk("CMD: %x %x %x | RSP: %x\n", wr_buf[0], wr_buf[1], wr_buf[2], rd_buf[0]);

	k_sleep(K_MSEC(10));

	return 0;
}

static int m_i2c_write_cmd_3_rsp_2(const struct device *dev, uint8_t byte1, uint8_t byte2, uint8_t byte3)
{
	const struct max32664_config *config = dev->config;
	uint8_t wr_buf[3];

	uint8_t rd_buf[2] = {0x00, 0x00};

	wr_buf[0] = byte1;
	wr_buf[1] = byte2;
	wr_buf[2] = byte3;

	gpio_pin_set_dt(&config->mfio_gpio, 0);
	k_sleep(K_USEC(300));
	i2c_write_dt(&config->i2c, wr_buf, sizeof(wr_buf));

	k_sleep(K_MSEC(MAX32664_DEFAULT_CMD_DELAY));

	// gpio_pin_set_dt(&config->mfio_gpio, 0);
	k_sleep(K_USEC(300));
	i2c_read_dt(&config->i2c, rd_buf, sizeof(rd_buf));
	k_sleep(K_MSEC(500));

	gpio_pin_set_dt(&config->mfio_gpio, 1);

	printk("CMD: %x %x %x | RSP: %x %x \n", wr_buf[0], wr_buf[1], wr_buf[2], rd_buf[0], rd_buf[1]);

	k_sleep(K_MSEC(10));

	return 0;
}

static int m_i2c_write(const struct device *dev, uint8_t *wr_buf, uint32_t wr_len)
{
	const struct max32664_config *config = dev->config;

