Protocentral/healthypi-move-fw/drivers/sensor/max32664/max32664.c
	uint8_t rd_buf[1] = {0x00};

	gpio_pin_set_dt(&config->mfio_gpio, 0);
	k_sleep(K_USEC(300));
	i2c_write_dt(&config->i2c, wr_buf, wr_len);

	k_sleep(K_MSEC(MAX32664_DEFAULT_CMD_DELAY));

	k_sleep(K_USEC(300));
	i2c_read_dt(&config->i2c, rd_buf, sizeof(rd_buf));
	k_sleep(K_MSEC(MAX32664_DEFAULT_CMD_DELAY));

	gpio_pin_set_dt(&config->mfio_gpio, 1);

	printk("Write %d bytes | RSP: %d \n", wr_len, rd_buf[0]);

	k_sleep(K_MSEC(45));

	return 0;
}

static int max32664_do_enter_app(const struct device *dev)
{
	const struct max32664_config *config = dev->config;

	LOG_DBG("MAX32664D entering app mode\n");

	gpio_pin_configure_dt(&config->mfio_gpio, GPIO_OUTPUT);

	// Enter APPLICATION mode
	gpio_pin_set_dt(&config->mfio_gpio, 1);
	k_sleep(K_MSEC(10));

	gpio_pin_set_dt(&config->reset_gpio, 0);
	k_sleep(K_MSEC(10));

	gpio_pin_set_dt(&config->reset_gpio, 1);
	k_sleep(K_MSEC(1000));
	// End of APPLICATION mode

	gpio_pin_configure_dt(&config->mfio_gpio, GPIO_INPUT);
	
	m_read_op_mode(dev);

	uint8_t ver_buf[4] = {0};
	if(m_get_ver(dev, ver_buf)==0)
	{
		LOG_INF("MAX32664D Version: %d.%d.%d\n", ver_buf[1], ver_buf[2], ver_buf[3]);
	}
	else
	{
		LOG_INF("MAX32664D not Found\n");
		return -ENODEV;
	}

	m_read_hub_status(dev);
	k_sleep(K_MSEC(200));
	m_read_hub_status(dev);

	//m_i2c_write_cmd_3(dev, 0x10, 0x03, 0x56, MAX32664_DEFAULT_CMD_DELAY);

	//gpio_pin_set_dt(&config->mfio_gpio, 0);
	//k_sleep(K_USEC(300));
	//gpio_pin_set_dt(&config->reset_gpio, 0);

	return 0;

}


static void bpt_time_to_byte_le(uint32_t time, uint8_t *byte_time)
{
	printk("MAX32664 Set Time: %d\n", time);
	byte_time[0] = (time & 0x000000FF);
	byte_time[1] = (time & 0x0000FF00) >> 8;
	byte_time[2] = (time & 0x00FF0000) >> 16;
	byte_time[3] = (time & 0xFF000000) >> 24;

	printk("Hex Time: %x %x %x %x\n", byte_time[0], byte_time[1], byte_time[2], byte_time[3]);
}

static int m_set_date_time(const struct device *dev, uint32_t date, uint32_t time)
{
	const struct max32664_config *config = dev->config;
	uint8_t wr_buf[DATE_TIME_VECTOR_SIZE] = {0x50, 0x04, 0x04, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
	uint8_t rd_buf[1] = {0x00};

	uint8_t byte_date[4];

	bpt_time_to_byte_le(date, byte_date);

	wr_buf[3] = byte_date[0];
	wr_buf[4] = byte_date[1];
	wr_buf[5] = byte_date[2];
	wr_buf[6] = byte_date[3];

	uint8_t byte_time[4];
	bpt_time_to_byte_le(time, byte_time);

	wr_buf[7] = byte_time[0];
	wr_buf[8] = byte_time[1];
	wr_buf[9] = byte_time[2];
	wr_buf[10] = byte_time[3];

	m_i2c_write(dev, wr_buf, sizeof(wr_buf));

	return 0;
}

static int m_set_bp_cal_values(const struct device *dev, uint32_t sys, uint32_t dia)
{
	const struct max32664_config *config = dev->config;

	uint8_t wr_buf[6] = {0x50, 0x04, 0x01, 0x00, 0x00, 0x00};
	uint8_t rd_buf[1] = {0x00};

	wr_buf[3] = sys >> 16;
	wr_buf[4] = sys >> 8;
	wr_buf[5] = sys;

	m_i2c_write(dev, wr_buf, sizeof(wr_buf));

	// Set diastolic BP
	wr_buf[2] = 0x02;

	wr_buf[3] = dia >> 16;
	wr_buf[4] = dia >> 8;
	wr_buf[5] = dia;

	m_i2c_write(dev, wr_buf, sizeof(wr_buf));

	return 0;
}

static int m_set_spo2_coeffs(const struct device *dev, float a, float b, float c)
{
	const struct max32664_config *config = dev->config;

	uint8_t wr_buf[15] = {0x50, 0x04, 0x06, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
	uint8_t rd_buf[1] = {0x00};

	int32_t a_int = (int32_t)(a * 100000);

	wr_buf[3] = (a_int & 0xff000000) >> 24;
	wr_buf[4] = (a_int & 0x00ff0000) >> 16;
	wr_buf[5] = (a_int & 0x0000ff00) >> 8;
	wr_buf[6] = (a_int & 0x000000ff);

	int32_t b_int = (int32_t)(b * 100000);

	wr_buf[7] = (b_int & 0xff000000) >> 24;
	wr_buf[8] = (b_int & 0x00ff0000) >> 16;
	wr_buf[9] = (b_int & 0x0000ff00) >> 8;
	wr_buf[10] = (b_int & 0x000000ff);

	int32_t c_int = (int32_t)(c * 100000);

	wr_buf[11] = (c_int & 0xff000000) >> 24;
	wr_buf[12] = (c_int & 0x00ff0000) >> 16;
	wr_buf[13] = (c_int & 0x0000ff00) >> 8;
	wr_buf[14] = (c_int & 0x000000ff);

	m_i2c_write(dev, wr_buf, sizeof(wr_buf));

	return 0;
}

static int maxm86146_set_spo2_coeffs(const struct device *dev, float a, float b, float c)
{
	const struct max32664_config *config = dev->config;

	uint8_t wr_buf[15] = {0x50, 0x07, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
	uint8_t rd_buf[1] = {0x00};

	int32_t a_int = (int32_t)(a * 100000);

	wr_buf[3] = (a_int & 0xff000000) >> 24;
	wr_buf[4] = (a_int & 0x00ff0000) >> 16;
	wr_buf[5] = (a_int & 0x0000ff00) >> 8;
	wr_buf[6] = (a_int & 0x000000ff);

	int32_t b_int = (int32_t)(b * 100000);

	wr_buf[7] = (b_int & 0xff000000) >> 24;
	wr_buf[8] = (b_int & 0x00ff0000) >> 16;
	wr_buf[9] = (b_int & 0x0000ff00) >> 8;
	wr_buf[10] = (b_int & 0x000000ff);

	int32_t c_int = (int32_t)(c * 100000);

	wr_buf[11] = (c_int & 0xff000000) >> 24;
	wr_buf[12] = (c_int & 0x00ff0000) >> 16;
	wr_buf[13] = (c_int & 0x0000ff00) >> 8;
	wr_buf[14] = (c_int & 0x000000ff);

	m_i2c_write(dev, wr_buf, sizeof(wr_buf));

	return 0;
}

static int max32664_set_mode_raw(const struct device *dev)
{
	printk("Entering RAW mode...\n");
	// Enter appl mode
	m_i2c_write_cmd_3(dev, 0x01, 0x00, 0x00, MAX32664_DEFAULT_CMD_DELAY);

	// Read raw sensor data
	m_i2c_write_cmd_3(dev, 0x10, 0x00, 0x01, MAX32664_DEFAULT_CMD_DELAY);

	// Set interrupt threshold
	m_i2c_write_cmd_3(dev, 0x10, 0x01, 0x02, MAX32664_DEFAULT_CMD_DELAY);

	// Enable AFE
	m_i2c_write_cmd_3(dev, 0x44, 0x03, 0x01, MAX32664_DEFAULT_CMD_DELAY);

	// Enable BPT estimation mode
	m_i2c_write_cmd_3(dev, 0x52, 0x04, 0x02, MAX32664_DEFAULT_CMD_DELAY);

	// Disable AGC
	m_i2c_write_cmd_3(dev, 0x52, 0x01, 0x00, MAX32664_DEFAULT_CMD_DELAY);

	// Disable AGC
	m_i2c_write_cmd_3(dev, 0x52, 0x00, 0x00, MAX32664_DEFAULT_CMD_DELAY);
	k_sleep(K_MSEC(200));

	// Set MAX30101 LED1 current
	m_i2c_write_cmd_4(dev, 0x40, 0x03, 0x0C, 0x7F);
	k_sleep(K_MSEC(200));

	// Set MAX30101 LED2 current
	m_i2c_write_cmd_4(dev, 0x40, 0x03, 0x0D, 0x7F);
	k_sleep(K_MSEC(200));

	return 0;
}

static int max32664c_set_mode_raw(const struct device *dev)
{
	printk("MAX32664 Entering RAW mode...\n");
	// Enter appl mode
	// m_i2c_write_cmd_3(dev, 0x01, 0x00, 0x00);

	// Read raw sensor data
	m_i2c_write_cmd_3(dev, 0x10, 0x00, 0x01, MAX32664_DEFAULT_CMD_DELAY);

	// Set interrupt threshold
	m_i2c_write_cmd_3(dev, 0x10, 0x01, 0x01, MAX32664_DEFAULT_CMD_DELAY);

	// Enable Accel
	m_i2c_write_cmd_4(dev, 0x44, 0x04, 0x01, 0x00);
	k_sleep(K_MSEC(150));

	// Enable AFE
	m_i2c_write_cmd_3(dev, 0x44, 0x00, 0x01, MAX32664_DEFAULT_CMD_DELAY);
	k_sleep(K_MSEC(600));

	// Set Sample rate
	m_i2c_write_cmd_4(dev, 0x40, 0x00, 0x12, 0x18);

	// Set LED1 Current (half)
	m_i2c_write_cmd_4(dev, 0x40, 0x00, 0x23, 0xff);

	// Set LED2 Current (half)
	m_i2c_write_cmd_4(dev, 0x40, 0x00, 0x24, 0xff);

