Protocentral/healthypi-move-fw/drivers/sensor/max32664/max32664.c
	// Set LED3 Current (half)
	m_i2c_write_cmd_4(dev, 0x40, 0x00, 0x25, 0xff);

	return 0;
}



static int max32664_load_calib(const struct device *dev)
{
	printk("Loading calibration vector...\n");

	struct max32664_data *data = dev->data;

	// Load calib vector
	m_i2c_write(dev, data->calib_vector, sizeof(data->calib_vector));
	k_sleep(K_MSEC(100));

	return 0;
}

static int max32664_set_mode_bpt_est(const struct device *dev)
{
	printk("Entering BPT estimation mode...\n");

	struct max32664_data *data = dev->data;

	// Enter appl mode
	// m_i2c_write_cmd_3(dev, 0x01, 0x00, 0x00);

	// Load calib vector
	//m_i2c_write(dev, data->calib_vector, sizeof(data->calib_vector));
	m_i2c_write(dev, m_bpt_cal_vector, sizeof(m_bpt_cal_vector));

	// Set date and time
	m_set_date_time(dev, DEFAULT_DATE, DEFAULT_TIME);

	// Set SpO2 calibration coeffs (A, B, C)
	m_set_spo2_coeffs(dev, DEFAULT_SPO2_A, DEFAULT_SPO2_B, DEFAULT_SPO2_C);

	// Set output mode to algo + sensor data
	m_i2c_write_cmd_3(dev, 0x10, 0x00, 0x03, MAX32664_DEFAULT_CMD_DELAY);

	// Set interrupt threshold
	m_i2c_write_cmd_3(dev, 0x10, 0x01, 0x08, MAX32664_DEFAULT_CMD_DELAY);

	// Enable AGC
	m_i2c_write_cmd_3(dev, 0x52, 0x00, 0x01, MAX32664_DEFAULT_CMD_DELAY);

	// Enable AFE
	m_i2c_write_cmd_3(dev, 0x44, 0x03, 0x01, MAX32664_DEFAULT_CMD_DELAY);

	// Enable BPT estimation mode
	m_i2c_write_cmd_3(dev, 0x52, 0x04, 0x02, MAX32664_DEFAULT_CMD_DELAY);
	k_sleep(K_MSEC(100));

	return 0;
}

static int max32664_set_mode_bpt_cal(const struct device *dev)
{
	printk("Starting BPT calibration...\n");

	// Output mode sensor + algo data
	m_i2c_write_cmd_3(dev, 0x10, 0x00, 0x03, MAX32664_DEFAULT_CMD_DELAY);

	// Set interrupt threshold
	m_i2c_write_cmd_3(dev, 0x10, 0x01, 0x04, MAX32664_DEFAULT_CMD_DELAY);
	k_sleep(K_MSEC(400));

	// Enable AFE
	m_i2c_write_cmd_3(dev, 0x44, 0x03, 0x01, MAX32664_DEFAULT_CMD_DELAY);
	k_sleep(K_MSEC(100));

	// Enable BPT algorithm in calibration mode
	m_i2c_write_cmd_3(dev, 0x52, 0x04, 0x01, MAX32664_DEFAULT_CMD_DELAY);

	return 0;
}

static int max32664_stop_estimation(const struct device *dev)
{
	printk("Stopping BPT estimation...\n");

	// Disable AFE
	m_i2c_write_cmd_3(dev, 0x44, 0x03, 0x00, MAX32664_DEFAULT_CMD_DELAY);
	k_sleep(K_MSEC(40));

	// Disable BPT estimation mode
	m_i2c_write_cmd_3(dev, 0x52, 0x04, 0x00, MAX32664_DEFAULT_CMD_DELAY);
	k_sleep(K_MSEC(20));

	// Disable AGC
	m_i2c_write_cmd_3(dev, 0x52, 0x00, 0x00, MAX32664_DEFAULT_CMD_DELAY);
	k_sleep(K_MSEC(20));

	return 0;
}

int max32664_get_sample_fifo(const struct device *dev)
{
	struct max32664_data *data = dev->data;
	const struct max32664_config *config = dev->config;

	uint8_t wr_buf[2] = {0x12, 0x01};

	uint8_t hub_stat = m_read_hub_status(dev);
	if (hub_stat & MAX32664_HUB_STAT_DRDY_MASK)
	{
		int fifo_count = max32664_get_fifo_count(dev);

		if (fifo_count > 0)
		{
			int sample_len;
			// printk("F: %d | ", fifo_count);
			data->num_samples = fifo_count;

			if (data->op_mode == MAX32664_OP_MODE_RAW)
			{
				sample_len = 12;
			}
			else if (data->op_mode == MAX32664_OP_MODE_BPT)
			{
				sample_len = 23;
			}

			i2c_write_dt(&config->i2c, wr_buf, sizeof(wr_buf));
			k_sleep(K_USEC(300));
			i2c_read_dt(&config->i2c, buf, ((sample_len * fifo_count) + 1));

			for (int i = 0; i < fifo_count; i++)
			{
				uint32_t led_ir = (uint32_t)buf[(sample_len * i) + 1] << 16;
				led_ir |= (uint32_t)buf[(sample_len * i) + 2] << 8;
				led_ir |= (uint32_t)buf[(sample_len * i) + 3];

				data->samples_led_ir[i] = led_ir;

				uint32_t led_red = (uint32_t)buf[(sample_len * i) + 4] << 16;
				led_red |= (uint32_t)buf[(sample_len * i) + 5] << 8;
				led_red |= (uint32_t)buf[(sample_len * i) + 6];

				data->samples_led_red[i] = led_red;

				// bytes 7,8,9, 10,11,12 are ignored

				if (data->op_mode == MAX32664_OP_MODE_BPT)
				{
					data->bpt_status = buf[(sample_len * i) + 13];
					data->bpt_progress = buf[(sample_len * i) + 14];

					uint16_t bpt_hr = (uint16_t)buf[(sample_len * i) + 15] << 8;
					bpt_hr |= (uint16_t)buf[(sample_len * i) + 16];

					data->hr = (bpt_hr / 10);

					data->bpt_sys = buf[(sample_len * i) + 17];
					data->bpt_dia = buf[(sample_len * i) + 18];

					uint16_t bpt_spo2 = (uint16_t)buf[(sample_len * i) + 19] << 8;
					bpt_spo2 |= (uint16_t)buf[(sample_len * i) + 20];

					data->spo2 = (bpt_spo2 / 10);

					uint16_t spo2_r_val = (uint16_t)buf[(sample_len * i) + 21] << 8;
					spo2_r_val |= (uint16_t)buf[(sample_len * i) + 22];

					data->spo2_r_val = (spo2_r_val / 1000);
					data->hr_above_resting = buf[(sample_len * i) + 23];
				}
			}
		}
	}
	else
	{
		// printk("FIFO empty\n");
	}

	return 0;
}

static int max32664_sample_fetch(const struct device *dev,
								 enum sensor_channel chan)
{
	struct max32664_data *data = dev->data;
	data->num_samples = 0;

	return max32664_get_sample_fifo(dev);
}

static int max32664_channel_get(const struct device *dev,
								enum sensor_channel chan,
								struct sensor_value *val)
{
	//struct max32664_data *data = dev->data;

	/*int fifo_chan;

	switch (chan)
	{
	case SENSOR_CHAN_PPG_RED_1:
		val->val1 = data->samples_led_red[0];
		break;
	case SENSOR_CHAN_PPG_IR_1:
		val->val1 = data->samples_led_ir[0];
		break;
	case SENSOR_CHAN_PPG_RED_2:
		val->val1 = data->samples_led_red[1];
		break;
	case SENSOR_CHAN_PPG_IR_2:
		val->val1 = data->samples_led_ir[1];
		break;
	case SENSOR_CHAN_PPG_RED_3:
		val->val1 = data->samples_led_red[2];
		break;
	case SENSOR_CHAN_PPG_IR_3:
		val->val1 = data->samples_led_ir[2];
		break;
	case SENSOR_CHAN_PPG_RED_4:
		val->val1 = data->samples_led_red[3];
		break;
	case SENSOR_CHAN_PPG_IR_4:
		val->val1 = data->samples_led_ir[3];
		break;
	case SENSOR_CHAN_PPG_RED_5:
		val->val1 = data->samples_led_red[4];
		break;
	case SENSOR_CHAN_PPG_IR_5:
		val->val1 = data->samples_led_ir[4];
		break;
	case SENSOR_CHAN_PPG_RED_6:
		val->val1 = data->samples_led_red[5];
		break;
	case SENSOR_CHAN_PPG_IR_6:
		val->val1 = data->samples_led_ir[5];
		break;
	case SENSOR_PPG_NUM_SAMPLES:
		val->val1 = data->num_samples;
		break;
	case SENSOR_CHAN_PPG_HR:
		val->val1 = data->hr;
		break;
	case SENSOR_CHAN_PPG_SPO2:
		val->val1 = data->spo2;
		break;
	case SENSOR_CHAN_PPG_SPO2_R_VAL:
		val->val1 = data->spo2_r_val;
		break;
	case SENSOR_CHAN_PPG_BPT_STATUS:
		val->val1 = data->bpt_status;
		break;
	case SENSOR_CHAN_PPG_BPT_PROGRESS:
		val->val1 = data->bpt_progress;
		break;
	case SENSOR_CHAN_PPG_BP_SYS:
		val->val1 = data->bpt_sys;
		break;
	case SENSOR_CHAN_PPG_BP_DIA:
		val->val1 = data->bpt_dia;
		break;
	case SENSOR_CHAN_PPG_HR_ABOVE_RESTING:
		val->val1 = data->hr_above_resting;
		break;
	default:
		LOG_ERR("Unsupported sensor channel");
		return -ENOTSUP;
	}*/

