Protocentral/healthypi-move-fw/drivers/sensor/max32664/max32664.c
	return 0;
}

static int max32664_attr_set(const struct device *dev,
							 enum sensor_channel chan,
							 enum sensor_attribute attr,
							 const struct sensor_value *val)
{
	struct max32664_data *data = dev->data;
	switch (attr)
	{
	case MAX32664_ATTR_OP_MODE:
		if (val->val1 == MAX32664_OP_MODE_RAW)
		{
			max32664_set_mode_raw(dev);
			data->op_mode = MAX32664_OP_MODE_RAW;
		}
		else if (val->val1 == MAX32664_OP_MODE_BPT)
		{
			max32664_set_mode_bpt_est(dev);
			data->op_mode = MAX32664_OP_MODE_BPT;
		}
		else if (val->val1 == MAX32664_OP_MODE_BPT_CAL_START)
		{
			max32664_set_mode_bpt_cal(dev);
			data->op_mode = MAX32664_OP_MODE_BPT_CAL_START;
		}
		else if (val->val1 == MAX32664_OP_MODE_BPT_CAL_GET_VECTOR)
		{
			data->op_mode = MAX32664_OP_MODE_BPT_CAL_GET_VECTOR;
		}
		else if (val->val1 == MAX32664C_OP_MODE_RAW)
		{
			max32664c_set_mode_raw(dev);
			data->op_mode = MAX32664C_OP_MODE_RAW;
		}
		else
		{
			LOG_ERR("Unsupported sensor operation mode");
			return -ENOTSUP;
		}
		break;
	case MAX32664_ATTR_DATE_TIME:
		uint32_t m_date = (uint32_t)val->val1;
		uint32_t m_time = (uint32_t)val->val2;
		m_set_date_time(dev, m_date, m_time); // val1 = date, val2 = time
		break;
	case MAX32664_ATTR_BP_CAL:
		uint32_t m_sys = (uint32_t)val->val1;
		uint32_t m_dia = (uint32_t)val->val2;
		m_set_bp_cal_values(dev, m_sys, m_dia); // va1 = sys, val2 = dia
		break;
	case MAX32664_ATTR_LOAD_CALIB:
		max32664_load_calib(dev);
		break;
	case MAX32664_ATTR_STOP_EST:
		max32664_stop_estimation(dev);
		break;
	case MAX32664_ATTR_ENTER_BOOTLOADER:
		max32664_do_enter_bl(dev);
		break;
	default:
		LOG_ERR("Unsupported sensor attribute");
		return -ENOTSUP;
	}

	return 0;
}

static const struct sensor_driver_api max32664_driver_api = {
	.attr_set = max32664_attr_set,

	.sample_fetch = max32664_sample_fetch,
	.channel_get = max32664_channel_get,

#ifdef CONFIG_SENSOR_ASYNC_API
	.submit = max32664_submit,
	.get_decoder = max32664_get_decoder,
#endif
};

#ifdef CONFIG_PM_DEVICE
static int max32664_pm_action(const struct device *dev,
							  enum pm_device_action action)
{
	int ret = 0;

	switch (action)
	{
	case PM_DEVICE_ACTION_RESUME:
		/* Re-initialize the chip */

		break;
	case PM_DEVICE_ACTION_SUSPEND:
		/* Put the chip into sleep mode */

		break;
	default:
		return -ENOTSUP;
	}

	return ret;
}
#endif /* CONFIG_PM_DEVICE */

static int max32664_chip_init(const struct device *dev)
{
	const struct max32664_config *config = dev->config;
	// struct max32664_data *data = dev->data;

	if (!device_is_ready(config->i2c.bus))
	{
		LOG_ERR("Bus device is not ready");
		return -ENODEV;
	}

	gpio_pin_configure_dt(&config->reset_gpio, GPIO_OUTPUT);
	gpio_pin_configure_dt(&config->mfio_gpio, GPIO_OUTPUT);

	gpio_pin_configure_dt(&config->mfio_gpio, GPIO_OUTPUT);

	// Enter APPLICATION mode
	gpio_pin_set_dt(&config->mfio_gpio, 1);
	k_sleep(K_MSEC(10));

	gpio_pin_set_dt(&config->reset_gpio, 0);
	k_sleep(K_MSEC(10));

	gpio_pin_set_dt(&config->reset_gpio, 1);
	k_sleep(K_MSEC(1000));
	// End of APPLICATION mode

	gpio_pin_configure_dt(&config->mfio_gpio, GPIO_INPUT);
	
	m_read_op_mode(dev);

	uint8_t ver_buf[4] = {0};
	if(m_get_ver(dev, ver_buf)==0)
	{
		LOG_INF("MAX32664D Version: %d.%d.%d\n", ver_buf[1], ver_buf[2], ver_buf[3]);
	}
	else
	{
		LOG_INF("MAX32664D not Found\n");
		return -ENODEV;
	}

	#ifdef CONFIG_PM_DEVICE
	pm_device_driver_init(dev, max32664_pm_action);
	#endif
	return 0;
}



/*
 * Main instantiation macro, which selects the correct bus-specific
 * instantiation macros for the instance.
 */
#define MAX32664_DEFINE(inst)                                       \
	static struct max32664_data max32664_data_##inst;               \
	static const struct max32664_config max32664_config_##inst =    \
		{                                                           \
			.i2c = I2C_DT_SPEC_INST_GET(inst),                      \
			.reset_gpio = GPIO_DT_SPEC_INST_GET(inst, reset_gpios), \
			.mfio_gpio = GPIO_DT_SPEC_INST_GET(inst, mfio_gpios),   \
	};                                                              \
	PM_DEVICE_DT_INST_DEFINE(inst, max32664_pm_action);             \
	SENSOR_DEVICE_DT_INST_DEFINE(inst,                              \
								 max32664_chip_init,                \
								 PM_DEVICE_DT_INST_GET(inst),       \
								 &max32664_data_##inst,             \
								 &max32664_config_##inst,           \
								 POST_KERNEL,                       \
								 CONFIG_SENSOR_INIT_PRIORITY,       \
								 &max32664_driver_api)

DT_INST_FOREACH_STATUS_OKAY(MAX32664_DEFINE)
